In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv('titanic.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
df[df['Embarked'].isnull()]

Missing data not at random (MNAR) : systematic missing values

In [ ]:
import numpy as np
df['cabin_null']=np.where(df["Cabin"].isnull(),1,0)
df.head()

   PassengerId  Survived  Pclass  ... Cabin Embarked  cabin_null
0            1         0       3  ...   NaN        S           1
1            2         1       1  ...   C85        C           0
2            3         1       3  ...   NaN        S           1
3            4         1       1  ...  C123        S           0
4            5         0       3  ...   NaN        S           1

[5 rows x 13 columns]

In [ ]:
df['cabin_null'].mean()

0.7710437710437711

In [ ]:
df.groupby(['Survived'])['cabin_null'].mean()

Survived
0    0.876138
1    0.602339
Name: cabin_null, dtype: float64

Missing at random (MAR)

In [ ]:
Men-- hide their salary
women-- hide their age

All the techniques to handle missing values

1) Through mean,median,mode replacement
2) randpm sampling Imputataion
3) Capturing NAN values  with a new feature
4) End of distribution imputation
5) Arbitrary imputation
6) Frequent categories Imputation

1) Mean , Meidan , Mode Imputation
when to use this?
Mean/Median imputation has an assumption that the data is missing compeletly at random (MCAR)

Solve this by replacing thr NAN with most frequent occurence of the variables

In [ ]:
df=pd.read_csv('titanic.csv',usecols=['Age','Fare','Survived'])
df.head(5)

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [ ]:
df.isnull().mean()

Survived    0.000000
Age         0.198653
Fare        0.000000
dtype: float64

In [ ]:
def impute_nan(df,variable,median):
  df[variable+"_median"]=df[variable].fillna(median)

In [ ]:
median=df.Age.median()
median

28.0

In [ ]:
impute_nan(df,"Age",median)
df.head(5)

   Survived   Age     Fare  Age_median
0         0  22.0   7.2500        22.0
1         1  38.0  71.2833        38.0
2         1  26.0   7.9250        26.0
3         1  35.0  53.1000        35.0
4         0  35.0   8.0500        35.0

Advantages and disadvantages of mean,median,mode imputation for missing values

Advantages
1) Easy to implement (robust to outliers)
2) Faster way to obtain the complete dataset

Disadvantages
1) Change or distortion in the original variance (Standard deviation)
2) impacts co relation